
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: Single-user , expiring  5 Jul 2021
Serial number: 401609700731
  Licensed to: Yongseok Kim
               Indiana University Bloomington

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000; see help set_maxvar.

. do draw_figure3 

. clear all

. set more off

. set graphics off

. 
. cd "~/Projects/Replication/BKS2009"
/Users/apple/Projects/Replication/BKS2009

. use "analysis/temp/prepared", replace

. 
. keep if fyear - year(ipodate2) >= 5
(52,474 observations deleted)

. 
. gen ipocohort = .
(91,201 missing values generated)

. replace ipocohort = 1960 if ipodate2 <= mdy(12, 31, 1969)
(18,733 real changes made)

. replace ipocohort = 1970 if mdy(1, 1, 1970) <= ipodate2 & ipodate2 <= mdy(12,
>  31, 1974)
(22,518 real changes made)

. replace ipocohort = 1975 if mdy(1, 1, 1975) <= ipodate2 & ipodate2 <= mdy(12,
>  31, 1979)
(5,275 real changes made)

. replace ipocohort = 1980 if mdy(1, 1, 1980) <= ipodate2 & ipodate2 <= mdy(12,
>  31, 1984)
(12,455 real changes made)

. replace ipocohort = 1985 if mdy(1, 1, 1985) <= ipodate2 & ipodate2 <= mdy(12,
>  31, 1989)
(13,748 real changes made)

. replace ipocohort = 1990 if mdy(1, 1, 1990) <= ipodate2 & ipodate2 <= mdy(12,
>  31, 1994)
(11,708 real changes made)

. replace ipocohort = 1995 if mdy(1, 1, 1995) <= ipodate2 & ipodate2 <= mdy(12,
>  31, 1999)
(6,103 real changes made)

. replace ipocohort = 2000 if mdy(1, 1, 2000) <= ipodate2 & ipodate2 < .
(661 real changes made)

. 
. collapse (count) nobs = cashr (mean) mean_cashr = cashr, by(fyear ipocohort)

. drop if missing(ipocohort)
(0 observations deleted)

. 
. twoway  ///
> (scatter mean_cashr fyear if ipocohort == 1960, con(l)) ///
> (scatter mean_cashr fyear if ipocohort == 1970, con(l)) ///
> (scatter mean_cashr fyear if ipocohort == 1975, con(l)) ///
> (scatter mean_cashr fyear if ipocohort == 1980, con(l)) ///
> (scatter mean_cashr fyear if ipocohort == 1985, con(l)) ///
> (scatter mean_cashr fyear if ipocohort == 1990, con(l)) ///
> (scatter mean_cashr fyear if ipocohort == 1995, con(l)) ///
> (scatter mean_cashr fyear if ipocohort == 2000, con(l)), ///
> legend(label(1 "1960s") label(2 "1970s") label(3 "1975s") label(4 "1980s") la
> bel(5 "1985s") label(6 "1990s") label(7 "1995s") label(8 "2000s") rows(2) pos
> (12) size(vsmall)) ///
> legend(order(1 2 3 4 5 6 7 8)) ///
> xtitle("Year") ytitle("cash/assets") ///
> yscale(range(0 0.45)) ylabel(0(0.05)0.45) ///
> xscale(range(1980 2006)) xlabel(1980(2)2006)

. 
. graph export "analysis/output/fig/fig3.pdf", replace
(file analysis/output/fig/fig3.pdf written in PDF format)

. 
end of do-file
