
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: Single-user , expiring  5 Jul 2021
Serial number: 401609700731
  Licensed to: Yongseok Kim
               Indiana University Bloomington

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000; see help set_maxvar.

. do draw_figure2 

. clear all

. set more off

. set graphics off

. 
. cd "~/Projects/Replication/BKS2009"
/Users/apple/Projects/Replication/BKS2009

. use "analysis/temp/prepared", replace

. 
. * Calculate increase in cash flow risk
. preserve

. collapse (mean) ind_cfvol = cfvol, by (sic2 fyear)

. keep if fyear == 1980 | fyear == 2006
(1,228 observations deleted)

. tsset sic2 fyear
       panel variable:  sic2 (unbalanced)
        time variable:  fyear, 2006 to 2006, but with a gap
                delta:  1 unit

. bysort sic2: gen Dind_cfvol = ind_cfvol - ind_cfvol[_n - 1] if sic2 == sic2[_
> n - 1]
(64 missing values generated)

. bysort sic2: keep if _n == _N
(1 observation deleted)

. egen cfvol_group = cut(Dind_cfvol), group(5)
(63 missing values generated)

. keep sic2 cfvol_group

. tempfile cfvol_group

. save `cfvol_group'
file /var/folders/5x/ys8vrl6n4yvbdxjwvb5k0nf00000gn/T//St70534.000002 saved

. restore

. 
. * Summarize mean cash ratio by group
. merge m:1 sic2 using analysis/temp/cfvol_group
file analysis/temp/cfvol_group.dta not found
r(601);

end of do-file
r(601);
