
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: Single-user , expiring  5 Jul 2021
Serial number: 401609700731
  Licensed to: Yongseok Kim
               Indiana University Bloomington

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000; see help set_maxvar.

. do prepare_data 

. clear all

. set more off

. 
. cd "~/Projects/Replication/BKS2009"
/Users/apple/Projects/Replication/BKS2009

. 
. * Use raw data
. use build/output/data

. save analysis/input/data, replace
file analysis/input/data.dta saved

. 
. destring gvkey, replace
gvkey: all characters numeric; replaced as long

. destring sic, replace
sic already numeric; no replace

. 
. replace sic = sich
sich not found
r(111);

end of do-file
r(111);
