
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: Single-user , expiring  5 Jul 2021
Serial number: 401609700731
  Licensed to: Yongseok Kim
               Indiana University Bloomington

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000; see help set_maxvar.

. do tabulate_tab6 

. clear all

. set more off

. 
. cd ~/Projects/Replication/BKS2009
/Users/apple/Projects/Replication/BKS2009

. use analysis/temp/prepared, replace

. 
. gen dum1990 = 0

. replace dum1990 = 1 if fyear >= 1990
(76,164 real changes made)

. la var dum1990 "1990s dummy"

. gen dum2000 = 0

. replace dum2000 = 1 if fyear >= 2000
(27,438 real changes made)

. la var dum2000 "2000s dummy"

. 
. g V = mve + dt
(1,688 missing values generated)

. g E = ib + xint + txditc
(10,021 missing values generated)

. g NA = at - che
(378 missing values generated)

. g RD = xrd

. replace RD = 0 if missing(RD)
(0 real changes made)

. g I = xint
(6,921 missing values generated)

. g D = dvc
(657 missing values generated)

. g L = che
(378 missing values generated)

. 
. tsset gvkey fyear
       panel variable:  gvkey (unbalanced)
        time variable:  fyear, 1980 to 2006, but with gaps
                delta:  1 unit

. 
. foreach v in V E NA RD I D L {
  2.         g d_`v' = (`v' - L2.`v') / at
  3.         g d2_`v' = (F2.`v' - `v') / at
  4.         replace `v' = `v' / at
  5. }
(28,432 missing values generated)
(28,432 missing values generated)
(114,965 real changes made)
(37,208 missing values generated)
(37,208 missing values generated)
(106,622 real changes made)
(26,942 missing values generated)
(26,942 missing values generated)
(116,270 real changes made)
(26,795 missing values generated)
(26,750 missing values generated)
(54,567 real changes made, 331 to missing)
(33,784 missing values generated)
(33,781 missing values generated)
(102,847 real changes made, 9 to missing)
(27,249 missing values generated)
(27,251 missing values generated)
(35,385 real changes made, 2 to missing)
(26,942 missing values generated)
(26,942 missing values generated)
(115,377 real changes made)

. 
. reghdfe V E d_E d2_E d_NA d2_NA RD d_RD d2_RD I d_I d2_I D d_D d2_D d2_V L c.
> L##dum1990##dum2000, noabs cl(gvkey fyear)
(MWFE estimator converged in 1 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters
note: L omitted because of collinearity
note: 1.dum1990#1.dum2000 omitted because of collinearity
note: 1.dum1990#1.dum2000#c.L omitted because of collinearity

HDFE Linear regression                            Number of obs   =     58,478
Absorbing 1 HDFE group                            F(  20,     22) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.2763
                                                  Adj R-squared   =     0.2761
Number of clusters (gvkey)   =      7,717         Within R-sq.    =     0.2763
Number of clusters (fyear)   =         23         Root MSE        =     1.7055

                           (Std. Err. adjusted for 23 clusters in gvkey fyear)
------------------------------------------------------------------------------
             |               Robust
           V |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           E |  -.7961084   .2419991    -3.29   0.003    -1.297984    -.294233
         d_E |   .1547878   .1121884     1.38   0.182    -.0778767    .3874524
        d2_E |  -.2125259   .1495721    -1.42   0.169    -.5227195    .0976678
        d_NA |   .3799304   .0653754     5.81   0.000     .2443501    .5155107
       d2_NA |   .3117789   .0592648     5.26   0.000     .1888712    .4346865
          RD |   5.336867   .7053723     7.57   0.000     3.874014    6.799719
        d_RD |   .4843827   .2214136     2.19   0.040     .0251989    .9435665
       d2_RD |   2.847359   .7615014     3.74   0.001     1.268101    4.426616
           I |   4.252964   .8405927     5.06   0.000     2.509681    5.996246
         d_I |  -5.962128   1.045664    -5.70   0.000    -8.130701   -3.793554
        d2_I |  -.0962155   .7732381    -0.12   0.902    -1.699813    1.507382
           D |   5.477044   1.014191     5.40   0.000     3.373741    7.580348
         d_D |  -1.259766   .2744194    -4.59   0.000    -1.828877   -.6906548
        d2_D |   1.314371   1.237538     1.06   0.300    -1.252127    3.880869
        d2_V |  -.0924602   .0469567    -1.97   0.062    -.1898425    .0049221
           L |   1.865748    .228674     8.16   0.000     1.391507    2.339989
           L |          0   1.34e-17     0.00   1.000    -2.77e-17    2.77e-17
   1.dum1990 |   .1697017   .0451338     3.76   0.001     .0760998    .2633035
             |
 dum1990#c.L |
          1  |   .4171558   .4597076     0.91   0.374    -.5362194    1.370531
             |
   1.dum2000 |   .0856794   .0613289     1.40   0.176    -.0415089    .2128677
             |
 dum2000#c.L |
          1  |  -.8574441   .6632937    -1.29   0.210    -2.233031    .5181428
             |
     dum1990#|
     dum2000 |
        0 1  |          0  (empty)
        1 1  |          0  (omitted)
             |
     dum1990#|
 dum2000#c.L |
        0 1  |          0  (empty)
        1 1  |          0  (omitted)
             |
       _cons |   .7360299   .0562418    13.09   0.000     .6193915    .8526684
------------------------------------------------------------------------------

. local r2_ : di %4.3f e(r2_a)

. local nobs = e(N)

. mat b = e(b)

. mat V = e(V)

. 
. mata
------------------------------------------------- mata (type end to exit) -----
: b = st_matrix("b")

: V = st_matrix("V")

: 
: V = V[selectindex(b :!= 0), selectindex(b :!= 0)]

: b = b[1, selectindex(b :!= 0)]

: 
: st_matrix("b", b)

: st_matrix("V", V)

: end
-------------------------------------------------------------------------------

. 
. mat colnames b = E d_E d2_E d_NA d2_NA RD d_RD d2_RD I d_I d2_I D d_D d2_D d2
> _V L dum1990 dum1990L dum2000 dum2000L _cons

. mat rownames V = E d_E d2_E d_NA d2_NA RD d_RD d2_RD I d_I d2_I D d_D d2_D d2
> _V L dum1990 dum1990L dum2000 dum2000L _cons

. mat colnames V = E d_E d2_E d_NA d2_NA RD d_RD d2_RD I d_I d2_I D d_D d2_D d2
> _V L dum1990 dum1990L dum2000 dum2000L _cons

. 
. ereturn post b V, obs(`nobs')

. eststo col1

. estadd local r2_ "`r2_'"

added macro:
                e(r2_) : "0.276"

. 
. preserve

. keep if at > 100 & fyear == 2004
(114,214 observations deleted)

. keep gvkey

. tempfile subsample

. save `subsample'
file /var/folders/5x/ys8vrl6n4yvbdxjwvb5k0nf00000gn/T//St69712.000002 saved

. restore

. 
. merge m:1 gvkey using `subsample'

    Result                           # of obs.
    -----------------------------------------
    not matched                        77,792
        from master                    77,792  (_merge==1)
        from using                          0  (_merge==2)

    matched                            38,863  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(77,792 observations deleted)

. 
. reghdfe V E d_E d2_E d_NA d2_NA RD d_RD d2_RD I d_I d2_I D d_D d2_D d2_V L c.
> L##dum1990##dum2000 if at > 100, noabs cl(gvkey fyear)
(MWFE estimator converged in 1 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters
note: L omitted because of collinearity
note: 1.dum1990#1.dum2000 omitted because of collinearity
note: 1.dum1990#1.dum2000#c.L omitted because of collinearity

HDFE Linear regression                            Number of obs   =     19,819
Absorbing 1 HDFE group                            F(  20,     22) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.3016
                                                  Adj R-squared   =     0.3009
Number of clusters (gvkey)   =      2,032         Within R-sq.    =     0.3016
Number of clusters (fyear)   =         23         Root MSE        =     1.1109

                           (Std. Err. adjusted for 23 clusters in gvkey fyear)
------------------------------------------------------------------------------
             |               Robust
           V |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           E |   1.103094   .5712619     1.93   0.066    -.0816307    2.287819
         d_E |  -.0961819   .0992414    -0.97   0.343     -.301996    .1096322
        d2_E |   .3034205   .2016407     1.50   0.147    -.1147567    .7215978
        d_NA |   .6076409     .11392     5.33   0.000     .3713853    .8438965
       d2_NA |   .3533022   .1970334     1.79   0.087      -.05532    .7619243
          RD |   4.704733   .8613642     5.46   0.000     2.918373    6.491093
        d_RD |   1.554909   .9271914     1.68   0.108    -.3679687    3.477786
       d2_RD |   6.180684   1.444142     4.28   0.000     3.185716    9.175652
           I |  -3.195244   1.258343    -2.54   0.019    -5.804888   -.5856002
         d_I |  -3.431092   1.468615    -2.34   0.029    -6.476813   -.3853698
        d2_I |  -4.491178    2.05316    -2.19   0.040    -8.749171   -.2331858
           D |    7.89634   1.536783     5.14   0.000     4.709247    11.08343
         d_D |    -1.5106   .3363367    -4.49   0.000     -2.20812   -.8130808
        d2_D |   2.651583    1.03079     2.57   0.017     .5138552    4.789311
        d2_V |  -.1011616    .071909    -1.41   0.173    -.2502917    .0479684
           L |   .9152434   .2351904     3.89   0.001     .4274883    1.402998
           L |          0   3.83e-17     0.00   1.000    -7.94e-17    7.94e-17
   1.dum1990 |    .247538   .0684778     3.61   0.002     .1055237    .3895522
             |
 dum1990#c.L |
          1  |   1.803488   .7063293     2.55   0.018     .3386503    3.268325
             |
   1.dum2000 |   .0379025   .0589875     0.64   0.527      -.08443     .160235
             |
 dum2000#c.L |
          1  |  -.7705287    .867012    -0.89   0.384    -2.568602    1.027544
             |
     dum1990#|
     dum2000 |
        0 1  |          0  (empty)
        1 1  |          0  (omitted)
             |
     dum1990#|
 dum2000#c.L |
        0 1  |          0  (empty)
        1 1  |          0  (omitted)
             |
       _cons |    .656738   .1007497     6.52   0.000     .4477959    .8656802
------------------------------------------------------------------------------

. local r2_ : di %4.3f e(r2_a)

. local nobs = e(N)

. mat b = e(b)

. mat V = e(V)

. 
. mata
------------------------------------------------- mata (type end to exit) -----
: b = st_matrix("b")

: V = st_matrix("V")

: 
: V = V[selectindex(b :!= 0), selectindex(b :!= 0)]

: b = b[1, selectindex(b :!= 0)]

: 
: st_matrix("b", b)

: st_matrix("V", V)

: end
-------------------------------------------------------------------------------

. 
. mat colnames b = E d_E d2_E d_NA d2_NA RD d_RD d2_RD I d_I d2_I D d_D d2_D d2
> _V L dum1990 dum1990L dum2000 dum2000L _cons

. mat rownames V = E d_E d2_E d_NA d2_NA RD d_RD d2_RD I d_I d2_I D d_D d2_D d2
> _V L dum1990 dum1990L dum2000 dum2000L _cons

. mat colnames V = E d_E d2_E d_NA d2_NA RD d_RD d2_RD I d_I d2_I D d_D d2_D d2
> _V L dum1990 dum1990L dum2000 dum2000L _cons

. 
. ereturn post b V, obs(`nobs')

. eststo col2

. estadd local r2_ "`r2_'"

added macro:
                e(r2_) : "0.301"

. 
. esttab col1 col2 using "analysis/output/tab/tab6.tex", replace booktabs longt
> able b(3) p(3) nostar msign("$-$") order(_cons E d_E d2_E d_NA d2_NA RD d_RD 
> d2_RD I d_I d2_I D d_D d2_D d2_V L dum1990L dum2000L dum1990 dum2000) title("
> OLS Regression Results for the Market Value of the Firm \label{tab:6}") ///
> nonotes nomtitles stat(r2_ N, fmt("%10.0fc") label("Adjusted $ R^{2}$" "Obs."
> )) ///
> coeflabels(_cons "Intercept" E "$ E_{t}$" d_E "$ dE_{t}$" d2_E "$ dE_{t+2}$" 
> d_NA "$ dNA_{t}$" ///
> d2_NA "$ dNA_{t+2}$" RD "$ RD_{t}$" d_RD "$ dRD_{t}$" d2_RD "$ dRD_{t+2}$" I 
> "$ I_{t}$" ///
> d_I "$ dI_{t}$" d2_I "$ dI_{t+2}$" D "$ D_{t}$" d_D "$ dD_{t}$" d2_D "$ dD_{t
> +2}$" d2_V "$ dV_{t+2}$" L "$ L_{t}$" dum1990 "$ D90s$" dum2000 "$ D00s$" dum
> 1990L "$ L_{t} * D90s$" dum2000L "$ L_{t} * D00s$") ///
> prefoot("\\")
(output written to analysis/output/tab/tab6.tex)

. 
. infix str l 1-500 using ///
>         "analysis/output/tab/tab6.tex", clear
(74 observations read)

.         replace l = subinstr(l,"\_","_",.)  
(18 real changes made)

.         // Replace
.         outfile using ///
>                         "analysis/output/tab/tab6.tex", ///
>                         noquote replace

. 
. 
. 
end of do-file
