
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: Single-user , expiring  5 Jul 2021
Serial number: 401609700731
  Licensed to: Yongseok Kim
               Indiana University Bloomington

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000; see help set_maxvar.

. do tabulate_tab2 

. clear all

. set more off

. 
. cd ~/Projects/Replication/BKS2009
/Users/apple/Projects/Replication/BKS2009

. use analysis/temp/prepared, replace

. 
. preserve

. collapse (mean) byni_cashr = cashr, by(fyear neg_ni)

. drop if missing(neg_ni)
(0 observations deleted)

. reshape wide byni_cashr, i(fyear) j(neg_ni)
(note: j = 0 1)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       54   ->      27
Number of variables                   3   ->       3
j variable (2 values)            neg_ni   ->   (dropped)
xij variables:
                             byni_cashr   ->   byni_cashr0 byni_cashr1
-----------------------------------------------------------------------------

. tempfile byni

. save `byni'
file /var/folders/5x/ys8vrl6n4yvbdxjwvb5k0nf00000gn/T//St70322.000002 saved

. restore

. 
. preserve

. collapse (mean) bydiv_cashr = cashr, by(fyear div_dum)

. drop if missing(div_dum)
(1 observation deleted)

. reshape wide bydiv_cashr, i(fyear) j(div_dum)
(note: j = 0 1)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       54   ->      27
Number of variables                   3   ->       3
j variable (2 values)           div_dum   ->   (dropped)
xij variables:
                            bydiv_cashr   ->   bydiv_cashr0 bydiv_cashr1
-----------------------------------------------------------------------------

. tempfile bydiv

. save `bydiv'
file /var/folders/5x/ys8vrl6n4yvbdxjwvb5k0nf00000gn/T//St70322.000004 saved

. restore

. 
. gen ipo_dum = .
(116,966 missing values generated)

. replace ipo_dum = 1 if cyear - year(ipodate2) >= 0 & cyear - year(ipodate2) <
> = 5
(46,043 real changes made)

. replace ipo_dum = 0 if cyear - year(ipodate2) > 5
(70,828 real changes made)

. collapse (mean) byipo_cashr = cashr, by(fyear ipo_dum)

. drop if missing(ipo_dum)
(27 observations deleted)

. reshape wide byipo_cashr, i(fyear) j(ipo_dum)
(note: j = 0 1)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       54   ->      27
Number of variables                   3   ->       3
j variable (2 values)           ipo_dum   ->   (dropped)
xij variables:
                            byipo_cashr   ->   byipo_cashr0 byipo_cashr1
-----------------------------------------------------------------------------

. merge 1:1 fyear using `bydiv'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                27  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fyear using `byni'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                27  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. order fyear byipo_cashr1 byipo_cashr0 bydiv_cashr1 bydiv_cashr0 byni_cashr1 b
> yni_cashr0

. 
. qui tostring byipo_cashr1 byipo_cashr0 bydiv_cashr0 bydiv_cashr1 byni_cashr0 
> byni_cashr1, force replace format ("%4.3f")

. 
. listtab * using "analysis/output/tab/tab2.tex", rstyle(tabular) replace ///
> head("\begin{tabular}{l c c c c c c}" ///
> "\toprule" ///
> "& \multicolumn{2}{c}{New Issues} & \multicolumn{2}{c}{Dividend Status} & \mu
> lticolumn{2}{c}{Accounting Performance} \\" ///
> "\cmidrule(lr){2-3} \cmidrule(lr){4-5} \cmidrule(lr){6-7}" ///
> "Year & \multicolumn{1}{p{2cm}}{\centering IPO Firms} & \multicolumn{1}{p{2cm
> }}{\centering Non-IPO Firms} & \multicolumn{1}{p{2cm}}{\centering Dividend Pa
> yer} & \multicolumn{1}{p{2cm}}{\centering Nondividend Payer} & \multicolumn{1
> }{p{2cm}}{\centering Negative Net Income} & \multicolumn{1}{p{2cm}}{\centerin
> g Nonnegative Net Income}\\" ///
> "\midrule") ///
> foot("\bottomrule" "\end{tabular}")

. 
end of do-file
