
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: Single-user , expiring  5 Jul 2021
Serial number: 401609700731
  Licensed to: Yongseok Kim
               Indiana University Bloomington

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000; see help set_maxvar.

. do tabulate_tab6 

. clear all

. set more off

. 
. cd ~/Projects/Replication/BKS2009
/Users/apple/Projects/Replication/BKS2009

. use analysis/temp/prepared, replace

. 
. gen dum1990 = 0

. replace dum1990 = 1 if fyear >= 1990
(76,389 real changes made)

. la var dum1990 "1990s dummy"

. gen dum2000 = 0

. replace dum2000 = 1 if fyear >= 2000
(27,553 real changes made)

. la var dum2000 "2000s dummy"

. 
. g V = mve + dt
(1,688 missing values generated)

. g E = ib + xint + txditc
(10,096 missing values generated)

. g NA = at - che
(382 missing values generated)

. g RD = xrd

. replace RD = 0 if missing(RD)
(0 real changes made)

. g I = xint
(6,949 missing values generated)

. g D = dvc
(668 missing values generated)

. g L = che
(382 missing values generated)

. 
. tsset gvkey fyear
       panel variable:  gvkey (unbalanced)
        time variable:  fyear, 1980 to 2006, but with gaps
                delta:  1 unit

. 
. foreach v in V E NA RD I D L {
  2.         g d_`v' = (`v' - L2.`v') / at
  3.         g d2_`v' = (F2.`v' - `v') / at
  4.         replace `v' = `v' / at
  5. }
(28,988 missing values generated)
(28,988 missing values generated)
(115,276 real changes made)
(37,797 missing values generated)
(37,797 missing values generated)
(106,858 real changes made)
(27,527 missing values generated)
(27,527 missing values generated)
(116,577 real changes made)
(27,388 missing values generated)
(27,335 missing values generated)
(54,870 real changes made, 335 to missing)
(34,336 missing values generated)
(34,333 missing values generated)
(103,148 real changes made, 9 to missing)
(27,835 missing values generated)
(27,837 missing values generated)
(35,340 real changes made, 2 to missing)
(27,527 missing values generated)
(27,527 missing values generated)
(115,684 real changes made)

. 
. reghdfe V E d_E d2_E d_NA d2_NA RD d_RD d2_RD I d_I d2_I D d_D d2_D d2_V L c.
> L##dum1990##dum2000, noabs cl(gvkey fyear)
(MWFE estimator converged in 1 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters
note: L omitted because of collinearity
note: 1.dum1990#1.dum2000 omitted because of collinearity
note: 1.dum1990#1.dum2000#c.L omitted because of collinearity

HDFE Linear regression                            Number of obs   =     57,968
Absorbing 1 HDFE group                            F(  20,     22) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.2781
                                                  Adj R-squared   =     0.2779
Number of clusters (gvkey)   =      7,775         Within R-sq.    =     0.2781
Number of clusters (fyear)   =         23         Root MSE        =     1.6913

                           (Std. Err. adjusted for 23 clusters in gvkey fyear)
------------------------------------------------------------------------------
             |               Robust
           V |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           E |  -.8215953   .2644624    -3.11   0.005    -1.370057   -.2731338
         d_E |   .2053724   .1455015     1.41   0.172    -.0963792    .5071241
        d2_E |  -.2374496   .1497158    -1.59   0.127    -.5479411     .073042
        d_NA |   .2629882   .0932096     2.82   0.010     .0696833    .4562932
       d2_NA |   .2872452   .0564819     5.09   0.000     .1701089    .4043814
          RD |   5.159321   .6379766     8.09   0.000     3.836238    6.482403
        d_RD |   .6850854   .2510926     2.73   0.012     .1643511     1.20582
       d2_RD |   2.832517   .7626833     3.71   0.001     1.250809    4.414226
           I |   3.589504   .8351482     4.30   0.000     1.857513    5.321495
         d_I |   -5.03202   1.100808    -4.57   0.000    -7.314957   -2.749083
        d2_I |   .0066207   .7866378     0.01   0.993    -1.624766    1.638008
           D |   6.772243   .9515825     7.12   0.000     4.798782    8.745704
         d_D |  -1.079453   .2438033    -4.43   0.000     -1.58507    -.573836
        d2_D |   3.538919   .8065973     4.39   0.000     1.866139      5.2117
        d2_V |  -.0879006   .0477388    -1.84   0.079    -.1869048    .0111036
           L |   1.822662   .2422744     7.52   0.000     1.320215    2.325108
           L |          0   5.89e-10     0.00   1.000    -1.22e-09    1.22e-09
   1.dum1990 |   .1775484   .0479514     3.70   0.001     .0781034    .2769935
             |
 dum1990#c.L |
          1  |   .4199902   .4542099     0.92   0.365    -.5219834    1.361964
             |
   1.dum2000 |   .0709273   .0606537     1.17   0.255    -.0548607    .1967154
             |
 dum2000#c.L |
          1  |  -.8408081   .6695847    -1.26   0.222    -2.229442    .5478255
             |
     dum1990#|
     dum2000 |
        0 1  |          0  (empty)
        1 1  |          0   5.78e-26     0.00   1.000    -1.20e-25    1.20e-25
             |
     dum1990#|
 dum2000#c.L |
        0 1  |          0  (empty)
        1 1  |          0  (omitted)
             |
       _cons |   .7596873    .050326    15.10   0.000     .6553175    .8640571
------------------------------------------------------------------------------

. local r2_ : di %4.3f e(r2_a)

. local nobs = e(N)

. mat b = e(b)

. mat V = e(V)

. 
. mata
------------------------------------------------- mata (type end to exit) -----
: b = st_matrix("b")

: V = st_matrix("V")

: 
: V = V[selectindex(b :!= 0), selectindex(b :!= 0)]

: b = b[1, selectindex(b :!= 0)]

: 
: st_matrix("b", b)

: st_matrix("V", V)

: end
-------------------------------------------------------------------------------

. 
. mat colnames b = E d_E d2_E d_NA d2_NA RD d_RD d2_RD I d_I d2_I D d_D d2_D d2
> _V L dum1990 dum1990L dum2000 dum2000L _cons

. mat rownames V = E d_E d2_E d_NA d2_NA RD d_RD d2_RD I d_I d2_I D d_D d2_D d2
> _V L dum1990 dum1990L dum2000 dum2000L _cons

. mat colnames V = E d_E d2_E d_NA d2_NA RD d_RD d2_RD I d_I d2_I D d_D d2_D d2
> _V L dum1990 dum1990L dum2000 dum2000L _cons

. 
. ereturn post b V, obs(`nobs')

. eststo col1

. estadd local r2_ "`r2_'"

added macro:
                e(r2_) : "0.278"

. 
. preserve

. keep if at > 100 & fyear == 2004
(114,512 observations deleted)

. keep gvkey

. tempfile subsample

. save `subsample'
file /var/folders/5x/ys8vrl6n4yvbdxjwvb5k0nf00000gn/T//St70339.000002 saved

. restore

. 
. merge m:1 gvkey using `subsample'

    Result                           # of obs.
    -----------------------------------------
    not matched                        78,271
        from master                    78,271  (_merge==1)
        from using                          0  (_merge==2)

    matched                            38,695  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(78,271 observations deleted)

. 
. reghdfe V E d_E d2_E d_NA d2_NA RD d_RD d2_RD I d_I d2_I D d_D d2_D d2_V L c.
> L##dum1990##dum2000 if at > 100, noabs cl(gvkey fyear)
(MWFE estimator converged in 1 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters
note: L omitted because of collinearity
note: 1.dum1990#1.dum2000 omitted because of collinearity
note: 1.dum1990#1.dum2000#c.L omitted because of collinearity

HDFE Linear regression                            Number of obs   =     19,604
Absorbing 1 HDFE group                            F(  20,     22) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.3021
                                                  Adj R-squared   =     0.3014
Number of clusters (gvkey)   =      2,031         Within R-sq.    =     0.3021
Number of clusters (fyear)   =         23         Root MSE        =     1.0891

                           (Std. Err. adjusted for 23 clusters in gvkey fyear)
------------------------------------------------------------------------------
             |               Robust
           V |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           E |   1.053819   .5462021     1.93   0.067    -.0789347    2.186573
         d_E |  -.0861564   .0951771    -0.91   0.375    -.2835417    .1112289
        d2_E |   .2909758   .2070279     1.41   0.174    -.1383739    .7203255
        d_NA |   .6315778   .1174043     5.38   0.000     .3880962    .8750594
       d2_NA |   .3112894   .1923965     1.62   0.120    -.0877164    .7102953
          RD |   4.661316   .8368311     5.57   0.000     2.925835    6.396798
        d_RD |   1.569654   .9230738     1.70   0.103    -.3446838    3.483992
       d2_RD |   6.326188    1.42045     4.45   0.000     3.380356     9.27202
           I |  -1.654119   1.307029    -1.27   0.219    -4.364731    1.056493
         d_I |  -4.073825   1.543566    -2.64   0.015    -7.274984   -.8726649
        d2_I |  -3.049505   1.880792    -1.62   0.119    -6.950028    .8510178
           D |   9.014401    1.67148     5.39   0.000     5.547963    12.48084
         d_D |  -1.332565   .3069939    -4.34   0.000    -1.969231   -.6958987
        d2_D |   4.593538   1.037738     4.43   0.000     2.441401    6.745676
        d2_V |  -.0964377   .0700628    -1.38   0.183    -.2417391    .0488637
           L |   1.058077   .2408701     4.39   0.000     .5585425    1.557611
           L |          0   7.02e-10     0.00   1.000    -1.46e-09    1.46e-09
   1.dum1990 |   .2878435   .0716852     4.02   0.001     .1391774    .4365097
             |
 dum1990#c.L |
          1  |   1.642251   .6499288     2.53   0.019     .2943808     2.99012
             |
   1.dum2000 |    .033077   .0595596     0.56   0.584     -.090442     .156596
             |
 dum2000#c.L |
          1  |  -.6948924   .7922655    -0.88   0.390     -2.33795    .9481656
             |
     dum1990#|
     dum2000 |
        0 1  |          0  (empty)
        1 1  |          0  (omitted)
             |
     dum1990#|
 dum2000#c.L |
        0 1  |          0  (empty)
        1 1  |          0  (omitted)
             |
       _cons |   .5797251    .099204     5.84   0.000     .3739887    .7854615
------------------------------------------------------------------------------

. local r2_ : di %4.3f e(r2_a)

. local nobs = e(N)

. mat b = e(b)

. mat V = e(V)

. 
. mata
------------------------------------------------- mata (type end to exit) -----
: b = st_matrix("b")

: V = st_matrix("V")

: 
: V = V[selectindex(b :!= 0), selectindex(b :!= 0)]

: b = b[1, selectindex(b :!= 0)]

: 
: st_matrix("b", b)

: st_matrix("V", V)

: end
-------------------------------------------------------------------------------

. 
. mat colnames b = E d_E d2_E d_NA d2_NA RD d_RD d2_RD I d_I d2_I D d_D d2_D d2
> _V L dum1990 dum1990L dum2000 dum2000L _cons

. mat rownames V = E d_E d2_E d_NA d2_NA RD d_RD d2_RD I d_I d2_I D d_D d2_D d2
> _V L dum1990 dum1990L dum2000 dum2000L _cons

. mat colnames V = E d_E d2_E d_NA d2_NA RD d_RD d2_RD I d_I d2_I D d_D d2_D d2
> _V L dum1990 dum1990L dum2000 dum2000L _cons

. 
. ereturn post b V, obs(`nobs')

. eststo col2

. estadd local r2_ "`r2_'"

added macro:
                e(r2_) : "0.301"

. 
. esttab col1 col2 using "analysis/output/tab/tab6.tex", replace booktabs longt
> able b(3) p(3) nostar msign("$-$") order(_cons E d_E d2_E d_NA d2_NA RD d_RD 
> d2_RD I d_I d2_I D d_D d2_D d2_V L dum1990L dum2000L dum1990 dum2000) title("
> OLS Regression Results for the Market Value of the Firm \label{tab:6}") ///
> nonotes nomtitles stat(r2_ N, fmt("%10.0fc") label("Adjusted $ R^{2}$" "Obs."
> )) ///
> coeflabels(_cons "Intercept" E "$ E_{t}$" d_E "$ dE_{t}$" d2_E "$ dE_{t+2}$" 
> d_NA "$ dNA_{t}$" ///
> d2_NA "$ dNA_{t+2}$" RD "$ RD_{t}$" d_RD "$ dRD_{t}$" d2_RD "$ dRD_{t+2}$" I 
> "$ I_{t}$" ///
> d_I "$ dI_{t}$" d2_I "$ dI_{t+2}$" D "$ D_{t}$" d_D "$ dD_{t}$" d2_D "$ dD_{t
> +2}$" d2_V "$ dV_{t+2}$" L "$ L_{t}$" dum1990 "$ D90s$" dum2000 "$ D00s$" dum
> 1990L "$ L_{t} * D90s$" dum2000L "$ L_{t} * D00s$") ///
> prefoot("\\")
(output written to analysis/output/tab/tab6.tex)

. 
. infix str l 1-500 using ///
>         "analysis/output/tab/tab6.tex", clear
(74 observations read)

.         replace l = subinstr(l,"\_","_",.)  
(18 real changes made)

.         // Replace
.         outfile using ///
>                         "analysis/output/tab/tab6.tex", ///
>                         noquote replace

. 
. 
. 
end of do-file
